/*----------越界导致的死循环---------------------*/
#include<stdio.h> 
int main()
{
	int i = 0;
	int arr[10] = { 0 };
	for (i = 0; i <= 12; i++)//i<=12,13,14都行， 但不能让i<=11 会结束循环报错【运行在vs中】 
	{
		arr[i] = 0;/*越界访问 arr[10]，arr[11]依旧能被赋值为0*/
		printf("hehe\n");
	}
	return 0;
	关于为什么出现死循环；[越界]
	因为变量i与数组arr都是局部变量，在内存中存储在栈区，
	栈区分配地址时，i的地址可能会与数组arr[]越界后的元素的地址发生重合，
	导致arr[i]将i置0； 
	
	不同的编译器 栈区分配空间各有千秋； 
	VC6.0	<=10 死循环
	gcc		<=11
	VS2013	<=12 
}
/*---------------------------------------------*/

/*------------Debug与Release调试---------------*/
Release 调试 会优化代码; 优化不代表好 
/*---------------------------------------------*/

/*---------------------------------------------*/














